---
kind: other
id: Methods.T:Autodesk.Revit.DB.ContentNode
source: html/85e73126-5d92-18bf-f4c1-61da27e89b86.htm
---
# ContentNode Methods

Returns an an instance of an Asset object, which contains definitions of the content node.